In [1]:
#16-02-2023
import pandas as pd
import numpy as np

In [2]:
d1={'c1':[1,2,3],
   'c2':[10,11,12]}
d2={'c2':[4,5,6],
   'c4':[13,14,15]}
d3={'c5':[7,8,9],
   'c6':[16,17,18]}

In [3]:
df1=pd.DataFrame(d1)

In [4]:
df1

   c1  c2
0   1  10
1   2  11
2   3  12

In [5]:
df2=pd.DataFrame(d2)

In [6]:
df2

   c2  c4
0   4  13
1   5  14
2   6  15

In [7]:
#concat means joining 2 dataframe
pd.concat([df1,df2])

    c1  c2    c4
0  1.0  10   NaN
1  2.0  11   NaN
2  3.0  12   NaN
0  NaN   4  13.0
1  NaN   5  14.0
2  NaN   6  15.0

In [8]:
pd.merge(df1,df2,how='inner',on='c2')

Empty DataFrame
Columns: [c1, c2, c4]
Index: []

In [9]:
#create 2 data frame such that with the hel of inner join we're gonna return 3 rows
a1={'c1':[1,2,3,4],
   'c2':[4,5,6,7]}
a2={'c2':[5,6,7,8],
   'c4':[19,10,11,12]}

In [10]:
af1=pd.DataFrame(a1)
af1

   c1  c2
0   1   4
1   2   5
2   3   6
3   4   7

In [11]:
af2=pd.DataFrame(a2)
af2

   c2  c4
0   5  19
1   6  10
2   7  11
3   8  12

In [12]:
pd.merge(af1,af2,how='inner',on='c2')

   c1  c2  c4
0   2   5  19
1   3   6  10
2   4   7  11

In [13]:
pd.merge(af1,af2,how='left',on='c2')

   c1  c2    c4
0   1   4   NaN
1   2   5  19.0
2   3   6  10.0
3   4   7  11.0

In [14]:
a={'usn':[1,2,3],
  'name':['jeey','rwe','raw']}
b={'name':['bob','foot','jeey'],
   'marks':[52,25,85]}

In [15]:
bf1=pd.DataFrame(a)
bf1

   usn  name
0    1  jeey
1    2   rwe
2    3   raw

In [16]:
bf2=pd.DataFrame(b)
bf2

   name  marks
0   bob     52
1  foot     25
2  jeey     85

In [17]:
#left will give all the value of leftside  and rightside comman 
pd.merge(bf1,bf2,how='left',on='name')

   usn  name  marks
0    1  jeey   85.0
1    2   rwe    NaN
2    3   raw    NaN

In [24]:
#17-02-2023 class
c={'usn':[1,2,3],
  'name':['simran','darshan','pooja']}
d={'usn':[6,5,1],
   'marks':[52,25,85]}

In [19]:
cf1=pd.DataFrame(c)
cf1

   usn     name
0    1   simran
1    2  darshan
2    3    pooja

In [20]:
cf2=pd.DataFrame(d)
cf2

   usn  marks
0    6     52
1    5     25
2    1     85

In [21]:
#right will give all the value of rightside  and leftside comman 
pd.merge(cf1,cf2,how='right',on='usn')

   usn    name  marks
0    6     NaN     52
1    5     NaN     25
2    1  simran     85

In [22]:
f=pd.read_csv("billionaire.csv")

In [ ]:
df

In [ ]:
data=pd.read_excel("stress.xlsx")

In [ ]:
data

In [ ]:
data.join(df)